## Pandas

## Series

In [82]:
import pandas as pd

In [83]:
s = pd.Series(['Peter','Emma','Tijmen','Melanie', 'Stijn'])

In [84]:
s

0      Peter
1       Emma
2     Tijmen
3    Melanie
4      Stijn
dtype: object

In [85]:
s.dtype

dtype('O')

In [86]:
s[s=='Stijn']

4    Stijn
dtype: object

## DataFrame

In [87]:
woonplaatsen = ['Lhee','Utrecht','Amsterdam','Hilversum','Utrecht']

In [88]:
w = pd.Series(woonplaatsen)
w

0         Lhee
1      Utrecht
2    Amsterdam
3    Hilversum
4      Utrecht
dtype: object

In [89]:
df = pd.DataFrame({'Naam':s, 'Woonplaats':w})
df

      Naam Woonplaats
0    Peter       Lhee
1     Emma    Utrecht
2   Tijmen  Amsterdam
3  Melanie  Hilversum
4    Stijn    Utrecht

In [90]:
df['leeftijd'] = [65,34,36,34,29]

In [91]:
df

      Naam Woonplaats  leeftijd
0    Peter       Lhee        65
1     Emma    Utrecht        34
2   Tijmen  Amsterdam        36
3  Melanie  Hilversum        34
4    Stijn    Utrecht        29

In [92]:
df['Naam'] + ', ' + df['Woonplaats']

0           Peter, Lhee
1         Emma, Utrecht
2     Tijmen, Amsterdam
3    Melanie, Hilversum
4        Stijn, Utrecht
dtype: object

In [93]:
df.shape

(5, 3)

In [94]:
df.dtypes

Naam          object
Woonplaats    object
leeftijd       int64
dtype: object

## Read CSV

In [95]:
!ls data.csv  # !dir op windows

data.csv

In [96]:
df[['Naam','leeftijd']]

      Naam  leeftijd
0    Peter        65
1     Emma        34
2   Tijmen        36
3  Melanie        34
4    Stijn        29

In [98]:
df[df['Naam'].isin(['Emma','Melanie'])]

      Naam Woonplaats  leeftijd
1     Emma    Utrecht        34
3  Melanie  Hilversum        34

In [99]:
df.loc[df['Naam'].isin(['Emma','Melanie']), ['Naam','leeftijd']]

      Naam  leeftijd
1     Emma        34
3  Melanie        34

In [106]:
df

      Naam Woonplaats  leeftijd
0    Peter       Lhee        65
1     Emma    Utrecht        34
2   Tijmen  Amsterdam        36
3  Melanie  Hilversum        34
4    Stijn    Utrecht        29

In [101]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['Naam', 'Woonplaats', 'leeftijd'], dtype='object')]

In [108]:
df2 = df.set_index('Woonplaats')
df2

               Naam  leeftijd
Woonplaats
Lhee          Peter        65
Utrecht        Emma        34
Amsterdam    Tijmen        36
Hilversum   Melanie        34
Utrecht       Stijn        29

In [114]:
df2.loc['Utrecht', :'leeftijd']

             Naam  leeftijd
Woonplaats
Utrecht      Emma        34
Utrecht     Stijn        29

In [78]:
df[df['Naam']=='Peter']

    Naam Woonplaats  leeftijd
0  Peter       Lhee        65

In [57]:
df

        Woonplaats  leeftijd
Naam
Peter         Lhee        65
Emma       Utrecht        34
Tijmen   Amsterdam        36
Melanie  Hilversum        34
Stijn      Utrecht        29

In [60]:
df.loc[['Peter'],:]

      Woonplaats  leeftijd
Naam
Peter       Lhee        65

In [81]:
df.reset_index()

   index     Naam Woonplaats  leeftijd
0      0    Peter       Lhee        65
1      1     Emma    Utrecht        34
2      2   Tijmen  Amsterdam        36
3      3  Melanie  Hilversum        34
4      4    Stijn    Utrecht        29